<template>
    <div>


        <div class="text-h1 ma-3"> 1日目 </div>
        <div class="text-h2"> 1 - 1 </div>
        <v-card>
            <v-card-title primary-title>
                <div>OSとは？</div>
            </v-card-title>
            <v-card-subtitle>
                <div>OS(基本ソフトウェア)はハードウェアとアプリケーションを仲介するソフトである</div>
            </v-card-subtitle>
            <v-divider></v-divider>
            <v-card-text class="text-h6">
                <div>代表的なOSには、Windows、macOS、UNIXがある</div>
                <div>
                    コンピュータのソフトウェアは大きく分けてOS（オペレーティング・システム、基本ソフトウェアと）アプリケーション（応用ソフトウェア）に 分類できます。
                    LinuxはOSの一種です。
                </div>
                <div>
                WindowsやmaxOsよりも歴史が古く、今でも現役として活躍しているOSとして UNIX　があります。UNIXはAT&Tで開発されましたが、その後いくつもの種類に枝分かれしていきました。
                そのため、現在では「UNIX」という単一のOSはありません。主なUNIXには、IBM社のAIXオラクル社のSolaris、HP社のHP-UX、オープンソースとして開発されているFreeDSD、OpenBSD、NetBSDなどがあります。
                </div>
            </v-card-text>
        </v-card>

        <v-divider class="my-3"></v-divider>
        <div  class="text-h2">1 - 2</div>
        <div>Linuxについて知る</div>
        <div>Linuxはカーネル部分の名称</div>
        <div>LinuxをOSとして使えるようにした配布形式がディストリビューションである</div>
        <div>ディストリビューションには、&nbsp;Red&nbsp;Had系&nbsp;や&nbsp;Debian系&nbsp;がある</div>
        <div>
            Linuxは、厳密にはWindowsやmacOSに相当するようなOSの名称ではありません。
            OSの中核部分であるプログラムをカーネル(karnel)といいますが、Linuxはカーネルにつけられた名前です。
            カーネル部分をさすときには「Linuxカーネル」と呼び、OSの意味で使っているときには「Linux OS」と表現することもあります。
        </div>
        <div>
            カーネルは、プログラムのプロセス管理、メモリ管理、ファイルシステム管理、ネットワーク管理、デバイス管理などを担当するプログラムです。
            カーネルは自動車におけるエンジンのようなものですが、自動車がエンジンだけでは使い物にならないのと同様に、OSもカーネルだけではソフトウェア製品として利用することができません。OSとしての機能を実現するには、カーネルだけではなく、アプリケーションが利用するソフトウェアライブラリ、ユーザーに使い勝手を提供するユーザーインタフェース、ユーザーが利用するツール、OSをコンピュータにインストールするためのインストーラなどが必要になります。それらを一つ一つ組み込んでいくには、専門的なスキルと大変な労力が必要になります。そこで、Linuxカーネルに、ライブラリやツール、インストーラが組み込まれていて一つの製品として提供されています。これをディストリビューションといいます。私たちが「Linux OS」として利用するのは、１つのOS製品として完成された「Linuxディストリビューション」です。
        </div>

        <div>
            ディストリビューションの種類は数え切れないほどありますが、大きく分けると３つに分類できます。
        </div>
        <div>
            ・Red Hat系ディストリビューション
        </div>
        <div>
            ・Debian系ディストリビューション
        </div>
        <div>
            ・その他のディストリビューション
        </div>

        <div>
            LPICはディストリビューションに対して中立的な資格制度ですが、実施の試験ではRed Hat系ディストリビューションとDevian系ディストリビューションの知識が必要とされます。
        </div>

        <div>
            Red Hat系ディストリビューション
        </div>

        <div>
            Red Hat系ディストリビューションとは、レッドハット社によって開発されたRed Hat Linuxをベースに開発されたものです。最初はRedHatLinuxをカスタマイズした程度のものでしたが、現在では独自の進化を遂げているものがあります。
        </div>
        
        <div>
            ・Fedora
            Linuxで最も成功した企業の１つがレッドハット社です。レッドハット社はかつてRed Hat Linuxという無償のディストリビューションがFedoraです。
            レッドハット社の支援を受けたFedora Projectによって開発され、半年に1度の新版リリースという速いペースで現在も開発が続けられています。

        </div>

        <div>
            ・Red Hat Enterprise Linux
             Fedoraの成果を取り入れ、企業システムとしても使えるように安定性を追い求めたものがRed Hat Enterprise Linux(RHEL)です。北米や日本で高いシェアを占めています。有償であり、決して安価ではありませんが、レッドハット社のサポートを受けることができるため、さまざまな企業が導入しています。
        </div>
        <div>
            ・CentOS
            Red Hat Enterprise Linuxのほとんどはオープンソースソフトウェアで作られているので、ライセンスに従ってソースコードを公開しなければなりません。そのソースコードをもとに作られた無償ディストリビューションをRHELクローンOSといいますが、その中でも知られているのがCentOSです。RHELとはほぼ100％の互換性を持ち、わずかな遅れでRHELのセキュリティアップデートにも追随しているため、レッドハット社のサポートを不要とする企業や個人での間で人気があります。
        </div>


        <div>
            Devian系ディストリビューション
            フリーソフトウェアだけを採用する無償ディストリビューションとして、Debian Projectというコミュニティが開発しているのがDebian GNU/Linux です。 Debian GNU/Linuxをベースとして、さまざまなディストリビューションが作られています。
        </div>

        <div>
            ・Ubuntu
            Ubuntuは、とりわけ個人ユーザーの間で高い人気を誇るディストリビューションです。
            Ubuntu Foundationというコミュニティを中心に開発されていますが、Canonical社が支援しています。それまでないがしろにされがちだった初心者に配慮し、使いやすさを重視しているため、とりわけデスクトップ用途で高い人気があります。最近ではパソコンに搭載して販売されることも多く、Windowsにとって代わるOSとしても注目されています。
            4月と10月の年2回、最新版がリリースされます。
            Ubuntuは2年に一度、LTS(Long Term Support：長期サポート)版がリリースされます。
            セキュリティアップデートなどのサポートが提供されるのは通常リリースから1年あまりですが、LTS版は5~10年物間提供されます。そのため長期にわたって利用したい場合はLTS版を利用することになります。
        </div>
        <div>
            Linux Mint(リナックス・ミント)
            Ubuntuから派生したディストリビューションで、使いやすいデスクトップOSを目指して開発されています。
        </div>

        <div>
            Raspbian
            超小型のワンボードコンピュータとして人気なのがRaspberry Piです。もともと教育向けに作られましたが、現在では手軽なIoTデバイスとして様々な分野で使われています。
            RaspbianはRasberryPi向けのディストリビューション、Debian GNU/Linuxをベースに作られています。
        </div>

        <div>
            その他のディストリビューション
        </div>
        <div>
            Red Hat系にもDebian系にも属さないディストリビューションもあります。その筆頭格はSlackwareです。
        </div>
        <div>
            Slackware
        </div>
        <div>
            もっとも古くからあるディストリビューションの１つで1993年に開発が始まりました。日本ではあまり使われていませんが8㎝CDに収まるようコンパクトにしたSLAXなど、いくつもの派生ディストリビューションが生み出されています。
        </div>

        <div>
            openSUSE
        </div>
        <div>
            Slackwareから派生した無償のディストリビューションで、現在はノベル社が支援するコミュニティ、openSUSE Projectによって開発されています。デスクトップからサーバー用とまで幅広く使うことができ独自のシステム管理ツールも充実しています。企業向けにはSUSE LinuxEnterprise Server(SLES)が販売されています。
        </div>

        <div>
            Linuxの特徴
        </div>
        <div>
            UNIXライクなOS
        </div>
        <div>
            多彩なディストリビューション
        </div>
        <div>
            多彩なプラットフォーム
        </div>
        <div>
            最適システム構成が可能
        </div>
        
        <div>
            Linuxを利用できる領域
        </div>
        <div>
            ネットワークサーバ
        </div>
        <div>
            組み込み機器
        </div>
        <div>
            パソコン
        </div>
        <div>
            大規模システム
        </div>
        <v-divider class="my-3"></v-divider>
        <div  class="text-h2">1 - 3</div>
        <div>オープンソースとは？</div>
        <div>
            ・オープンソースはソースコードを自由に利用できる。
        </div>
        <div>
            ・オープンソースのライセンスとしてGNU GPL
        </div>
        <div>
            ・オープンソースを支えるコミュニティがある
        </div>
        <div>
            ソースコードを公開して自由に開発を進めていくスタイルをオープンソースと呼んでいる。
        </div>
        <div>
            フリーソフトウェアとオープンソース
        </div>
        <div>
            オープンソースを推進しているOSI(Open Source Initiativce)ではオープンソースの定義として次の10項目を定めています。
        </div>
        <div>
            ①	ソフトウェアを販売したり無料で配布したりできること
        </div>
        <div>
            ②	ソースコードを入手できること
        </div>
        <div>
            ③	ソフトウェアを改良したり派生ソフトウェアを作成したりできること
        </div>
        <div>
            ④	作者のソースコードの完全性を維持すること
        </div>
        <div>
            ⑤	個人やグループを差別しないこと
        </div>
        <div>
            ⑥	利用分野に対して差別しないこと
        </div>
        <div>
            ⑦	再頒布するときに追加ライセンスを必要としないこと
        </div>
        <div>
            ⑧	ライセンスは特定の製品に依存しないこと
        </div>
        <div>
            ⑨	一緒に配布されるほかのソフトウェアを制限しないこと
        </div>
        <div>
            ⑩	技術的に中立であること
        </div>

        <div>
            ライセンス
        </div>
        <div>
            ・コンピュータソフトウェアを利用する際に利用者が守るべき約束事をライセンスといいます。ライセンスはソフトウェアを利用できる人数、利用できる期間、禁止行為などが記載されています。
        </div>

        <div>
            フリーソフトウェアやオープンソースウェアをまとめてFOSSやFLOSSと表現することがあります。フリーソフトウェアやオープンソースを推進する団体としてFSFがよく知られています。
        </div>
        <div>
            ちなみにOSIが認定しているオープンソースライセンスは、2019年5月時点で80以上もあります。
        </div>
        <v-divider class="my-3"></v-divider>
        <div  class="text-h2">
            GNU GPL
        </div>
        <div>
            GPLの特徴の1つはコピーレフトという概念で、GPLが適用されたソフトウェアのソースコードを修正して再配布する場合、変更した部分のソースコードも提供しなければならない、とされています。
            著作権で保護されるのとは対照的です。そのため、著作権(コピーライト)とひっかけてコピーレフトと言われています。
        </div>
        <div>
            再頒布
            ・入手したソフトウェアやコンテンツなどを別の場所で配布することを再配布といいます。市販されているソフトウェアの多くのフリーソフトウェアなどを再頒布することはライセンス違反になります。

        </div>

    </div>
</template>